---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.IFC.IFCAnyHandle})
source: html/789e5812-5195-8eb0-8a5b-ee188fccdc40.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	IList<IFCAnyHandle> values
)
```

## Parameters
- **name** (`System.String`)
- **values** (`System.Collections.Generic.IList < IFCAnyHandle >`)